from utils import Team

countries = {
    "Алматы": "Казахстан",
    "Астана": "Казахстан",
    "Баку": "Азербайджан",
    "Брест": "Беларусь",
    "Витебск": "Беларусь",
    "Гомель": "Беларусь",
    "Гродно": "Беларусь",
    "Днепр (Днепропетровск)": "Украина",
    "Долгопрудный": "Россия",
    "Донецк": "Украина",
    "Екатеринбург": "Россия",
    "Ереван": "Армения",
    "Запорожье": "Украина",
    "Зеленоград": "Россия",
    "Иерусалим": "Израиль",
    "Иркутск": "Россия",
    "Казань": "Россия",
    "Калининград": "Россия",
    "Калуга": "Россия",
    "Кембридж": "Великобритания",
    "Киев": "Украина",
    "Кишинёв": "Молдова",
    "Клайпеда": "Литва",
    "Краков": "Польша",
    "Курск": "Россия",
    "Львов": "Украина",
    "Манчестер": "Великобритания",
    "Минск": "Беларусь",
    "Москва": "Россия",
    "Нижний Новгород": "Россия",
    "Новосибирск": "Россия",
    "Нур-Султан": "Казахстан",
    "Одесса": "Украина",
    "Пермь": "Россия",
    "Петродворец": "Россия",
    "Рига": "Латвия",
    "Ростов-на-Дону": "Россия",
    "Самара": "Россия",
    "Санкт-Петербург": "Россия",
    "Саранск": "Россия",
    "Саратов": "Россия",
    "Серпухов": "Россия",
    "Симферополь": "Украина",
    "Сумы": "Украина",
    "Таллин": "Эстония",
    "Ташкент": "Узбекистан",
    "Тбилиси": "Грузия",
    "Томск": "Россия",
    "Тюмень": "Россия",
    "Ульяновск": "Россия",
    "Харьков": "Украина",
    "Челябинск": "Россия",
    "Ярославль": "Россия",
}

teams = {
    "Сборная Великобритании (мол.)": "Сборная Великобритании",
    "Сборная Молдовы (студенты)": "Сборная Молдовы",
    "Сборная Армении (студенты)": "Сборная Армении",
    "Молодёжная сборная Польши": "Сборная Польши"
}

cities = {"Днепр (Днепропетровск)": "Днепр",
          "Нур-Султан (Астана)": "Нур-Султан"}

team_countries = {
    "Der Verlorene Haufe": "Беларусь",
    "Extraconsulting": "Россия",
    "Город Ха": "Россия",
    "Сборная Армении": "Армения",
    "Сборная Великобритании": "Великобритания",
    "Сборная Латвии": "Латвия",
    "Сборная Сибири": "Россия",
    "Сборная Польши": "Польша"
}


def country_for_team(team: Team) -> str:
    return countries.get(team.city, team_countries.get(rename_team(team.name)))


def rename_team(team: str) -> str:
    return teams.get(team, team)


def rename_city(city: str) -> str:
    return cities.get(city, city)
